<!-- add-pr-comment:ecr_plan -->

# staging/ecr Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_ecr_repository.documentation will be created
  + resource "aws_ecr_repository" "documentation" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "notify/documentation"
      + region               = "ca-central-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
      + image_scanning_configuration {
          + scan_on_push = true
        }
    }
Plan: 1 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---

```